[
  {
    "name": "Bobby Larson, Lead Software Engineer & Founder",
    "review": "Audrey has knockout talent when it comes to understanding human experience, whether it's drawing people into a marketing funnel, designing the interactions of our next big web application, or spewing interestingly amusing facts about human interactions over a cup of coffee.\r\n\r\nI worked with her for nearly two years, and as a hard working Jill-of-all-trades, she was an endlessly invaluable resource to her employees, peers, and all of the company. Her quirky quips, kind heart, and attentive personality mimicked her distinguished style, and glued us into a cohesive force that I haven't experienced anywhere else.\r\n\r\nAudrey has got a style all her own, and I am proud to know her. I hope that I will have the opportunity to work with her again in the future."
  },
  {
    "name": "Aaron Chavez, VP of Engineering",
    "review": "Audrey notices things that other people don't. She is an extremely perceptive person. I enjoyed collaborating with Audrey over a span of two years on a variety of interviews and marketing content. She's an excellent communicator. Whenever we had a conversation I always knew we were going to end up on the same page. Her attention to detail served her well as she successfully transitioned into a UX-focused role. But her social awareness is what allowed her to build true connections and be integral to the culture at Alchemy.\r\n\r\nI recommend Audrey without reservation for any position emphasizing user experience, technical marketing, or the  interfaces between computers and people."
  },
  {
    "name": "Pawan Lakshmanan, Software Engineer",
    "review": "I had the opportunity to work closely with Audrey on a project at AlchemyAPI where she was the UX/frontend developer. In spite of this being a new role for her, she took it upon herself to get educated on the cutting edge UX design and usability techniques. She was able to successfully integrate this knowledge into our project and transformed it from an 'engineer-ish' looking website to a polished presentation ready website. With her combined experience of marketing and UX development, I highly recommend Audrey and believe she can contribute positively to any team."
  },
  {
    "name": "Nicholas Lineback, Software Engineer",
    "review": "In the year and a half that I have been at AlchemyAPI, Audrey has been the bridge between engineering and marketing. Rather than latching onto buzz words, she worked with the engineers to really understand the technology and make informed statements. As a result, AlchemyAPI's technology was featured or mentioned in publications including GigaOM, Wired, and MIT Technology Review. In addition to her desire to understand the core technologies at AlchemyAPI, Audrey also has a drive to learn about and use technologies such as JavaScript, CSS, and HTML in your job as a marketer. As such, I feel that Audrey is the embodiment of the technical marketer."
  },
  {
    "name": "Dave Taylor, Digital Storyteller",
    "review": "I enjoyed working with Audrey and found her reliable, responsive and a great addition to the team. Her input on both marketing and user experience (UX) design was definitely beneficial. I'd enjoy the chance to work with her again."
  },
  {
    "name": "Colby Toland, Software Engineer",
    "review": "I worked with Audrey at AlchemyAPI. She always had insightful and well reasoned guidance for our UX problems. I could always trust that she was pointing us in the right direction. She was always open to collaborating on designs and took ownership while incorporating others ideas into projects. I hope I have the opportunity to work with her again in the future."
  },
  {
    "name": "Zahra Mahoor, Software Engineer",
    "review": "I enjoyed working with Audrey and found her reliable, responsive and a great addition to the team. Her input on both marketing and user experience (UX) design was definitely beneficial. I'd enjoy the chance to work with her again."
  },
  {
    "name": "Kira Woodmansee, Designer",
    "review": "Audrey is sharp, creative, and quick to embrace new media trends. She BDA's brand very fast and always had great ideas for social media marketing. She has an instinctive grasp of marketing technique and really knows how to engage people. Audrey was always professional, on time, and courteous."
  },
  {
    "name": "Dinesh",
    "review": "Audrey was quickly pulled into the Palomar project activities and was expected to contribute to the project very quickly. She picked up the platform in a few days and started contributing almost immediately. She even worked hard during weeknights and weekends to complete some urgent tasks without being told to do so. She was performing while learning and I forgot that she had only been here for less than 2 months."
  }
]
