[
  {
    "item": 1,
    "title": "Verizon Media",
    "content": "Audience Insights data analytics application",
    "blurb": "Audience Insights data analytics application",
    "path": "/work/",
    "templateKey": "portfolio-post",
    "forSlug": "verizon-media",
    "description": "Big data and artificial intelligence application aimed at helping carriers monetize troves of data through the use of advanced machine learning techniques and deep analytics. Online segmentation tool for marketers and advertisers with predictions and recommendation engines. External-facing data visualization product that generates actionable insights after applying large scale machine learning and AI to network and third-party data. Applications include advertising, marketing and consumer lifestyle segmentation.",
    "description2": "Developed complex data visualizations and reusable components with the help of React, Mapbox, Leaflet.js, GeoJSON and D3.js. Integrated REST API JSON responses to display large amounts of data on client-side. Identified and communicated front-end best practices: lobbied for adoption of JavaScript design guide, automated testing and linting, React, ES6+, performance testing, productivity tools and workflows. Agile environment consisting of 3 week sprints. ",
    "description3": "Led front end internationalization and localization effort to offer this new mobile marketing intelligence tool to carriers outside of US, team to win $47mln America Movil business. Reduced front-end team development time by over 10 hours/week per person by decoupling UI and back end development.",
    "image": "portfolio/portfolio-item-1-1.png",
    "image2": "portfolio/portfolio-item-1-2.png",
    "image3": "portfolio/portfolio-item-1-3.png",
    "technology": "React, D3.js, JavaScript",
    "link": "verizon.com",
    "projectText": {
      "text1": "Engineer on Data Analytics Solutions team building a marketing analytics product that visualizes the large and complex data sets provided by Verizon’s troves of user data. Online segmentation tool for marketers and advertisers with predictions and recommendation engines. External-facing data visualization product that generates actionable insights after applying large scale machine learning and AI to network and third-party data. Applications include advertising, marketing and consumer lifestyle segmentation.",
      "text2": "Part of the Big Data Analytics team of 5+ engineers responsible for the front end of several Verizon big data analytic products visualizing large and complex data sets with various Big Data technologies, JavaScript frameworks and libraries. Developed dynamic and visually appealing dashboard charts/ widgets using D3.js library. Product Engineer for the Verizon Big Data Team. This team joins massive Verizon wireless subscriber internet browsing clickstream, location, and device data with 3rd party user demographics data to derive audience behavioral insights.Segmentation based on customers’ behavior, location, known and inferred demographics and other data points ",
      "text3": "Behavior analytics. Machine learning (ML) based Age, gender, income prediction using location and behavior information. Segmentation based on customers’ behavior, location, known and inferred demographics and other data points. Worked closely with engineering leads from other teams, responsible for machine learning, data architecture and QA, to ensure all parts of the different applications stacks are closely aligned and optimized.",
      "text5": "Engineered and improved several large geo-location features and products with the help of Mapbox, Leaflet.js, GeoJSON and D3.js.",
      "text6": "Engineer on Data Analytics Solutions team building a marketing analytics product that visualizes the large and complex data sets provided by Verizon’s troves of user data.",
      "text9": "Location-based user profiling and mapping visualization marketing application",
      "text10": "Developed dynamic and visually appealing dashboard charts/ widgets using D3.js library.",
      "text11": "Integrated REST API JSON response with to display large amounts of data on client-side.",
      "text12": "Prototyping UI designs with jQuery, HTML5, CSS3 and Bootstrap framework.",
      "text13": "Developed and optimized the responsive web application using Bootstrap framework.",
      "text14": "Collaborated with UX designer on an ongoing basis for implementing features and provided critical feedback while development of new user experiences.",
      "text15": "mobile user online activity data and location data based forecasting and classification modeling to understand user behavior for NFL/MLB.",
      "text17": "Develop UI of an external-facing data visualization product that generates actionable insights gleaned from applying large scale machine learning and AI to both Verizon network and third-party data. Applications include advertising, marketing and consumer lifestyle segmentation.",
      "text20": "Machine learning (ML) based Age, gender, income prediction using location and behavior information",
      "text21": "Multiple development initiatives to produce advertising targeting segments and lifestyle audiences for Oath/Aol, internal Verizon business units, and external customers",
      "text23": "Led front end internationalization and localization effort to offer the new mobile marketing intelligence tool to carriers outside of US as part of Big Data & AI Platform as a Service offering, team to win $47mln America Movil business.",
      "text24": "Responsible for front end customization of the platform with multiple verticals in 4 countries",
      "text25": "Behavior analytics. Machine learning (ML) based Age, gender, income prediction using location and behavior information. Segmentation based on customers’ behavior, location, known and inferred demographics and other data points",
      "text26": "Developed geofencing application for NFL and MLB using React. Collaborated with UX designer, product managers and QA to translate business requirements into completed features.",
      "text27": "Front-end engineer for big data and artificial intelligence applications aimed at helping carriers monetize troves of data through the use of advanced machine learning techniques and deep analytics.",

      "text29": "Spearheaded front-end customizations on cross-functional team tasked with rapidly delivering a multimillion dollar data analytics platform to four América Móvil markets in South America.",

      "text31": "Versatile front end engineer with user experience knowledge and design sensibility, drawing from years of experience working directly with customers in marketing. Excel at working on cross-functional teams requiring both collaboration and self motivation.",
      "text32": "Developed geofencing application using React.",
      "text33": "Find and address performance issues",
      "text34": "Champion modern frontend processes",
      "text35": "Product Engineer for the Verizon Big Data Team. This team joins massive Verizon wireless subscriber internet browsing clickstream, location, and device data with 3rd party user demographics data to derive audience behavioral insights."
    },
    "role": "Front-end Engineer"
  },
  {
    "item": 2,
    "content": "Application that helps you find movie scene locations all over San Francisco.",
    "blurb": "App using Google maps and multiple APIs",
    "title": "Film Locations in SF",
    "path": "/work/",
    "templateKey": "portfolio-post",
    "forSlug": "sf-film-app",
    "description": "I developed a single-page application featuring a map of SF film locations",
    "description3": "",
    "description2": "I developed a single-page application featuring a map of SF film locations which includes: map markers to identify movie scene locations, an autocomplete search function to easily discover over 700 films, and a search function to filter by street. I researched and implemented several third-party APIs to provide additional information about each location (StreetView images using Google Maps Image API) and film (movie reviews using NY Times API, movie poster and more using TMDb API). This user interface uses JavaScript, HTML and Knockoutjs. Knockoutjs uses observers to make your UI automatically stay in sync with an underlying data model, along with a powerful and extensible set of declarative bindings to enable productive development.",
    "image": "portfolio/portfolio-item-2-1.png",
    "image2": "portfolio/portfolio-item-2-2.png",
    "image3": "portfolio/portfolio-item-2-3.png",
    "technology": "Knockoutjs, AJAX, Bootstrap, jQuery, HTML5, Google Maps, Typekit",
    "link": "http://klammertime.github.io/P5-Neighborhood-Map/",
    "projectText": {
      "text1": "I developed a single-page application featuring a map of SF. I then added additional functionality, including: map markers to identify movie scene locations, an autocomplete search function to easily discover over 700 films, and a search function to filter by street. I then researched and implemented several third-party APIs to provide additional information about each location (StreetView images using Google Maps Image API) and film (movie reviews using NY Times API, movie poster and more using TMDb API).",
      "role": "Designer/Developer"
    }
  },
  {
    "item": 3,
    "content": "A recreation the classic arcade game Frogger",
    "blurb": "A recreation the classic arcade game Frogger",
    "title": "Classic Arcade Game",
    "path": "/work/",
    "templateKey": "portfolio-post",
    "forSlug": "games",
    "description": " I created all of the game logic and the code within app.js to add a number of entities to the game, including player characters, enemies, and gem prizes.",
    "image": "portfolio/portfolio-item-3-1.png",
    "image2": "portfolio/portfolio-item-3-2.png",
    "image3": "portfolio/portfolio-item-3-6.png",
    "role": "Developer",
    "technology": "Object-Oriented JavaScript, HTML5 Canvas, HTML5 Drag & Drop",
    "link": "http://klammertime.github.io/P3-Classic-Arcade-Game-Clone/"
  }
]
